// customers.js - 老客戶資料庫
// 格式："客戶編號": { name: "店名", sales: "銷售代號", list: [...] }

const clientDB = {

    // === 1. 魚一(元朗) ===
    "A1089": {
        name: "魚一(元朗)",
        sales: "A", 
        list: ["D07A","D03D","D47B","C01","D30","D21D","C22A","E06","D49","D15B","C31C","C50AB","C31","A03","C27A","D19ER","C54","C10A","C45BA","D39BA","C07A","F03","C01B","C01D","C14J","C29C","C56A","D79A"]
    },

    // === 2. 究極堂(銅) ===
    "A2724A": {
        name: "究極堂(銅)",
        sales: "A",
        list: ["D10JA", "D09D", "D10JD", "D58A", "B01", "B50B", "D19EA", "E03JA", "D10A", "D04B"]
    },

    // === 3. 究極堂(炮) ===
    "A2724": {
        name: "究極堂(炮)",
        sales: "A",
        list: ["D10JA", "D10JD", "B01", "D09D", "D58A", "E03JA", "B50B", "D12", "D19EA", "E08", "D79A", "D10A", "D58C", "C14J", "D39B"]
    },

    // === 4. 酒津(銅) ===
    "W3908": {
        name: "酒津(銅)",
        sales: "A",
        list: ["C01", "E03F", "E08AA", "D10JA", "D82", "D09B", "D12", "C09", "C09A", "A03", "C01CJ", "M007", "D84", "D04C", "C28B", "D50B", "D58A", "B14", "C20BA", "C27A", "D19E", "D31A", "C43", "D41AB", "M008E", "C04", "C14G", "C51", "C70", "D02B", "C10A", "C26B", "C53A", "D30", "D64AE", "D65", "C26G", "C50BB", "C62", "D03B", "C24B", "C43A", "C53B", "C54", "D03LB", "D03LK", "D19ER", "D42AA"]
    },

    // === 5. 醉潮館(荃灣) ===
    "A1586A": {
        name: "醉潮館(荃灣)",
        sales: "A",
        list: ["D03LC","D43","D60H","D60G","C24F","D30D","D64AE","B14H","C15","D21BA","D46AA","M003LA","M003LB","B50B","B74G","C01","C01FB","C04","C14DA","C49","D03LCA","D17C","D21AA","D21FC","D30E","D39B","D50AA","D53","D53B","D58","D60F","D80A","D80AA","H02A","M006B"]
    }

};
