// customers.js - 老客戶資料庫
// 格式："客戶編號": { name: "店名", sales: "銷售代號", list: [...] }

const clientDB = {

    // === 1. 魚一(元朗) ===
    "A1089": {
        name: "魚一(元朗)",
        sales: "A", 
        list: ["D07A","D03D","D47B","C01","D30","D21D","C22A","E06","D49","D15B","C31C","C50AB","C31","A03","C27A","D19ER","C54","C10A","C45BA","D39BA","C07A","F03","C01B","C01D","C14J","C29C","C56A","D79A"]
    },

    // === 2. 究極堂(銅) ===
    "A2724A": {
        name: "究極堂(銅)",
        sales: "A",
        list: ["D10JA", "D09D", "D10JD", "D58A", "B01", "B50B", "D19EA", "E03JA", "D10A", "D04B"]
    },

    // === 3. 究極堂(炮) ===
    "A2724": {
        name: "究極堂(炮)",
        sales: "A",
        list: ["D10JA", "D10JD", "B01", "D09D", "D58A", "E03JA", "B50B", "D12", "D19EA", "E08", "D79A", "D10A", "D58C", "C14J", "D39B"]
    },

    // === 4. 酒津(銅) ===
    "W3908": {
        name: "酒津(銅)",
        sales: "A",
        list: ["C01", "E03F", "E08AA", "D10JA", "D82", "D09B", "D12", "C09", "C09A", "A03", "C01CJ", "M007", "D84", "D04C", "C28B", "D50B", "D58A", "B14", "C20BA", "C27A", "D19E", "D31A", "C43", "D41AB", "M008E", "C04", "C14G", "C51", "C70", "D02B", "C10A", "C26B", "C53A", "D30", "D64AE", "D65", "C26G", "C50BB", "C62", "D03B", "C24B", "C43A", "C53B", "C54", "D03LB", "D03LK", "D19ER", "D42AA"]
    },

    // === 5. 醉潮館(荃灣) ===
    "A1586A": {
        name: "醉潮館(荃灣)",
        sales: "A",
        list: ["D03LC","D43","D60H","D60G","C24F","D30D","D64AE","B14H","C15","D21BA","D46AA","M003LA","M003LB","B50B","B74G","C01","C01FB","C04","C14DA","C49","D03LCA","D17C","D21AA","D21FC","D30E","D39B","D50AA","D53","D53B","D58","D60F","D80A","D80AA","H02A","M006B"]
    }, // 👈 這個逗號很重要，用來連接上一批資料

    // === 6. 松本(西環) ===
    "A1761": {
        name: "松本(西環)",
        sales: "A",
        list: ["C01","A03","D60D","B50B","C43","D79","D09F","B14","C14E","C53B","D21","D10A","D19ER","C38","D04C","C27A","C35B","E06","C23","D09HA","D84","C10A","C18E","C24B","C28B","C62","D12","D18","C18C","C54","D03LB","D42AA","D58A","E03F","F03","C05","C05A","C14G","C24A","D22","A12A","B01","D19E","AJ1","C04","C19C","C31","D88","E08","C18A","C26","C31B","C39","C41A","C53A","D09B","D17C","E03K"]
    },

    // === 7. 意壽司(福來邨) ===
    "A1256": {
        name: "意壽司(福來邨)",
        sales: "A",
        list: ["D07A","C01","C25A","B01","A03","D03CA","D21","D46A","M007","D49","D17E","C53","D58A","H01E","M003LB","A12A","C27","D55","D50A","D04C","D10JAA","W005"]
    },

    // === 8. 水戶(粉嶺) ===
    "A2168": {
        name: "水戶(粉嶺)",
        sales: "A",
        list: ["C28A","D60D","C01","B50B","D21BA","C14E","D10JAA","C27A","M004","C39","C39A","C25A","D21","D26","E02","D05","D09B","D22H","D65","D81A","C04","C31","D10JA","D50A","C41","D09HC","D79","D03LJ","C58AB","D17C","B01","C29C","D09D","C24A","C26","C51B","D59EA","D10A","C45BA","D04B","C01CK","C18E","D39B","D59D","H02"]
    },

    // === 9. 備長 ===
    "W3844": {
        name: "備長",
        sales: "A",
        list: ["B01","C01","D79","D17G","D17DD","A03","D06","B14","D19ER","D60D","C27A","D19E","D39BA","C01CO","C01CH","C18A","C18C","D88FB","C01CJ","D10KC","D30D","A07C","A12A","C04","C09","C09A","C13","C22A"]
    },

    // === 10. 竹虎京堂 ===
    "A2454": {
        name: "竹虎京堂",
        sales: "A",
        list: ["C19B", "C14E", "C01", "D82", "C28A", "C58", "C41A", "C61", "D18", "D64BA", "E11", "C24A", "D47B", "C53B", "C14DA", "C14G", "C25A", "D16",  "H01", "D48G", "C18E", "D53", "C25", "C39", "C39A", "D59H", "D88DA", "E08AA", "A07C", "C10A", "C18A", "C26C", "D09D", "D10", "D39GA", "D69", "B14AA", "C04", "C36D", "C45", "D51", "D64AE", "C87B", "D41AB", "D57A", "D58B", "C30C", "C31F", "C44C", "D15B", "D19E", "D50B"]
    },

    // === 11. 酩鬼 ===
    "W3229": {
        name: "酩鬼",
        sales: "A",
        list: ["D31A","D39H","C26A","D30E","C24A","B01","D19EA","D84","B14","C54","D21","C01","C53B","D09B","D69","E08AA","C26KB","C27A","D79","D88FH","C24F","C58AB","D16","D18A","D48B","H01","C26G","C36D","D10JA","D43","D52","C14DA","D10M","D12","D58B","D65","M004","C35A","D46A","D60D","D88DA","D88E","E03K","C01CJ","C39","C39A","D05C","D47B","D62A","D88"]
    },

    // === 12. 朝(深) ===
    "W3509": {
        name: "朝(深)",
        sales: "A",
        list: ["M007", "D84", "D82", "C01CJ", "D04B", "C01", "D68B", "D09", "D31A", "B01", "D41AB", "C28A", "D81A", "C70", "A03", "C36D",  "D59EA", "D69", "C04", "D39B", "C62A", "D60D", "D79", "C50AA", "D58A", "C54", "D21"]
    },

    // === 13. 惠比壽 ===
    "A2769": {
        name: "惠比壽",
        sales: "A",
        list: ["C31", "F01GB", "D09LA", "C01", "D64", "C01CJ", "C01CK", "D03D", "D10JA", "D60D", "C26", "B01", "A03", "C28B", "D09HB", "D97", "C23", "D61C", "D09B", "C34D", "D61B", "D09GA", "D09HA", "D21A", "C53B", "D47B", "D48B", "A12A", "C10A", "C87B", "D03LC", "D05", "D19E", "D58A"]
    }

};
